// Задача 29:
// Напишите программу, которая задаёт массив
// из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19, 4, 76, 3 -> [1, 2, 5, 7, 19,4,76,3]
// 6, 1, 33, 43, 12, 3 ,2, 9 -> [6, 1, 33,43,12,3,2,9]

const int N = 8;

int[] array = new int[N];
for (int i = 0; i < N; i++)
{
    array[i] = new Random().Next(0, 100);
    Console.Write(array[i] + " ");
}
